Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: These special characters are accepted to make it easier to use them inside a [] range (they can actually be used anywhere in the search pattern):
es_es: Estos caracteres especiales se aceptan para facilitar su uso dentro de un rango [] (en realidad, puede usarlos en cualquier lugar dentro del patrón de búsqueda):

source: To avoid matching a specific character, use "^" at the start of the range.
es_es: Use «^» al principio del rango para evitar emparejar un carácter en particular.

source: The [] item then matches everything but the characters included.
es_es: El elemento [] emparejará todo menos los caracteres incluidos.

source: A number of ranges are used very often.
es_es: Existe un número de rangos usados a menudo.

source: Vim provides a shortcut for these.
es_es: Vim ofrece accesos directos para esto.

source: Finds alphabetic characters.
es_es: Encuentra caracteres alfabéticos.

source: This is equal to using "/[a-zA-Z]".
es_es: Esto equivale a usar «/[a-zA-Z]».

source: Here are a few more of these:
es_es: Aquí hay más ejemplos:

source: Note: Using these predefined ranges works a lot faster than the character range it stands for.
es_es: Nota: El uso de estos rangos predeterminados es más rápido que el rango de caracteres que simbolizan.

source: These items can not be used inside [].
es_es: Estos elementos no se pueden usar dentro de [].

source: Thus "[\d\l]" does NOT work to match a digit or lowercase alpha.
es_es: Así, «[\d\l]» NO funciona para encontrar un dígito o un alfa minúscula.

source: Use "\(\d\|\l\)" instead.
es_es: En lugar de ello, use «\(\d\|\l\)».

source: The character range matches a fixed set of characters.
es_es: El rango de carácter empareja un conjunto específico de caracteres.

source: A character class is similar, but with an essential difference: The set of characters can be redefined without changing the search pattern.
es_es: Se parece una clase de carácter, pero con una importante diferencia: puede redefinir el conjunto de caracteres sin cambiar el patrón de búsqueda.

source: For example, search for this pattern: >
es_es: Por ejemplo, busque este patrón: >

source: The "\f" items stands for file name characters.
es_es: Los elementos «\f» simbolizan caracteres de nombre de archivo.

source: Thus this matches a sequence of characters that can be a file name.
es_es: Así, esto empareja una secuencia de caracteres que pueden ser un nombre de archivo.

source: Which characters can be part of a file name depends on the system you are using.
es_es: Qué caracteres pueden formar parte de un nombre de archivo dependen del sistema que esté usando.

source: On MS-Windows, the backslash is included, on Unix it is not.
es_es: En MS-Windows, la barra inversa está incluida, pero no en Unix.

source: This is specified with the 'isfname' option.
es_es: Puede especificar esto con la opción 'isfname'.

source: The default value for Unix is: >
es_es: El valor por omisión en Unix es: >

source: For other systems the default value is different.
es_es: El valor predeterminado depende del sistema.

source: Thus you can make a search pattern with "\f" to match a file name, and it will automatically adjust to the system you are using it on.
es_es: Así, puede crear un patrón de búsqueda con «\f» para emparejar un nombre de archivo, y ajustarse automáticamente al sistema en el que lo está usando.

source: Vim can find a pattern that includes a line break.
es_es: Vim puede encontrar un patrón que incluye un salto de línea.

source: You need to specify where the line break happens, because all items mentioned so far don't match a line break.
es_es: Debe especificar la aparición del salto de línea, ya que todos los elementos mencionados hasta ahora no se emparejan con un salto de línea.

# To check for a line break in a specific place, use the " " item: >
source: To check for a line break in a specific place, use the "\n" item: >
es_es: Para comprobar si hay un salto de línea en un lugar específico, use el elemento «\n»: >

source: This will match at a line that ends in "the" and the next line starts with "word".
es_es: Esto coincidiría en una línea que termina con «la», seguida de una que comienza con «palabra».

source: To match "the word" as well, you need to match a space or a line break.
es_es: Para encontrar también «la palabra», tendrá que emparejar el espacio o el salto de línea.

source: The item to use for it is "\_s": >
es_es: Para ello, use el elemento «\_s»: >

source: "\s" matches white space, "\_s" matches white space or a line break.
es_es: «\s» coincide con espacio en blanco, «\_s» coincide con espacio en blanco o un salto de línea.

source: Similarly, "\a" matches an alphabetic character, and "\_a" matches an alphabetic character or a line break.
es_es: De forma parecida, «\a» coincide con un carácter alfabético o un salto de línea.

source: The other character classes and ranges can be modified in the same way by inserting a "_".
es_es: Las otras clases de caracteres y rangos se pueden modificar de la misma forma insertando un «_».

source: Many other items can be made to match a line break by prepending "\_".
es_es: Puede hacer coincidir muchos otros elementos con un salto de línea prefijando «\_».

source: For example: "\_." matches any character or a line break.
es_es: Por ejemplo, «\_.» coincide con cualquier carácter o salto de línea.

source: Note: "\_.*" matches everything until the end of the file.
es_es: Nota: «\_.*» empareja todo hasta el final del archivo.

source: Be careful with this, it can make a search command very slow.
es_es: Use esto con cuidado, ya que puede reducir la velocidad de una orden de búsqueda.

source: Here are a few search patterns you might find useful.
es_es: Aquí dispone de unos cuantos patrones de búsqueda que puede encontrar útiles.

source: This shows how the items mentioned above can be combined.
es_es: Esto muestra cómo combinar los elementos anteriormente mencionados.

source: A sample license plate number is "1MGU103".
es_es: Un ejemplo de un número de matrícula es «1MGU103».

source: It has one digit, three uppercase letters and three digits.
es_es: Tiene un dígito, tres letras mayúsculas y tres dígitos.

source: Directly putting this into a search pattern: >
es_es: Puede insertar esto en un patrón búsqueda de la siguiente manera: >

source: Which one of these you should use?
es_es: ¿Cual debería usar?

source: Whichever one you can remember.
es_es: Él que recuerde.

source: The simple way you can remember is much faster than the fancy way that you can't.
es_es: La manera sencilla que puede recordar es más rápida que la compleja que no puede.

source: If you can remember them all, then avoid the last one, because it's both more typing and slower to execute.
es_es: Si los puede recordar todos, evite el último, ya que es más lento de teclear y de ejecutar.

source: In C programs (and many other computer languages) an identifier starts with a letter and further consists of letters and digits.
es_es: En programas C (y muchos otros lenguajes de programación), un identificador empieza con una letra seguida de letras y dígitos.

source: Underscores can be used too.
es_es: Puede usar subrayados.

source: This can be found with: >
es_es: Puede encontrar esto con: >

source: Note: "\<" and "\>" depend on the 'iskeyword' option.
es_es: Nota: «\<» y «\>» dependen de la opción 'iskeyword'.

source: If it includes "-", for example, then "ident-" is not matched.
es_es: De incluir un «-», por ejemplo, «ident-» no se encontrará.

source: In this situation use: >
es_es: Use lo siguiente en esta situación: >

source: < This checks if "\w" does not match before or after the identifier.
es_es: < Esto revisa se «\w» no se empareja antes o después de un identificador.

source: See |/\@<!| and |/\@!|.
es_es: Consulte |/\@<!| and |/\@!|.

source: *usr_05.txt* For Vim version 7.3.
es_es: *usr_05.esx* Para Vim versión 7.3.

source: Last change: 2009 Jun 04
es_es: Último cambio: 4/6/2009

source: You probably got tired of typing commands that you use very often.
es_es: Probablemente se haya cansado de introducir órdenes que usa muy a menudo.

source: To start Vim with all your favorite option settings and mappings, you write them in what is called the vimrc file.
es_es: Para iniciar Vim con todas sus opciones y macros favoritas, defínalos en lo que se llama el archivo «vimrc».

source: Vim executes the commands in this file when it starts up.
es_es: Vim ejecuta las órdenes en este archivo al inicio.

source: If you don't have a vimrc file yet, see |vimrc| to find out where you can create a vimrc file.
es_es: Si todavía no tiene un archivo vimrc, consulte |vimrc| para saber dónde puede crear un archivo vimrc.

source: Also, the ":version" command mentions the name of the "user vimrc file" Vim looks for.
es_es: La orden «:version» también menciona el nombre del «archivo vimrc de usuario» que Vim busca.

source: The vimrc file can contain all the commands that you type after a colon.
es_es: El archivo vimrc puede contener todas las órdenes que se pueden teclear tras «:».

source: The most simple ones are for setting options.
es_es: Los más sencillos son los que se usan para ajustar opciones.

source: For example, if you want Vim to always start with the 'incsearch' option on, add this line you your vimrc file: >
es_es: Por ejemplo, si quiere que Vim comience siempre con la opción 'incsearch' activada, añada la siguiente línea al archivo: >

source: For this new line to take effect you need to exit Vim and start it again.
es_es: Necesita salir de Vim e iniciarlo otra vez para que esta nueva línea tenga efecto.

source: Later you will learn how to do this without exiting Vim.
es_es: Luego verá cómo hacer esto sin salir de Vim.

source: This chapter only explains the most basic items.
es_es: Este capítulo sólo explica los elementos más básicos.

source: For more information on how to write a Vim script file: |usr_41.txt|.
es_es: Para más información sobre cómo escribir un archivo de script de Vim: |usr_41.txt|.

source: In the first chapter was explained how the example vimrc (included in the Vim distribution) file can be used to make Vim startup in not-compatible mode (see |not-compatible|).
es_es: En el primer capítulo se explicó como el archivo vimrc de ejemplo (incluido en la distribución de Vim) se puede emplear para iniciar Vim en modo no-compatible (ver |not-compatible|).

source: The file can be found here:
es_es: Puede encontrar el archivo aquí:

source: In this section we will explain the various commands used in this file.
es_es: En esta sección explicaremos las diferentes órdenes empleadas en este archivo.

source: This will give you hints about how to set up your own preferences.
es_es: Esto le dará pistas sobre cómo preparar su propia configuración.

source: Not everything will be explained though.
es_es: No todo se explicará, en cualquier caso.

source: Use the ":help" command to find out more.
es_es: Use la orden ":help" e investigue.

source: As mentioned in the first chapter, these manuals explain Vim working in an improved way, thus not completely Vi compatible.
es_es: Tal y como se mencionó en el primer capítulo, estos manuales explican un Vim funcionando en un modo mejorado, y por lo tanto no completamente Vi-compatible.

source: Setting the 'compatible' option off, thus 'nocompatible' takes care of this.
es_es: Desactivar la opción 'compatible' o activar 'nocompatible' se encarga de esto.

source: This specifies where in Insert mode the <BS> is allowed to delete the character in front of the cursor.
es_es: Esto especifica que se permita en el modo Insertar que <Retroceso> pueda eliminar el carácter delante del cursor.

source: The three items, separated by commas, tell Vim to delete the white space at the start of the line, a line break and the character before where Insert mode started.
es_es: Los tres elementos, separados por comas, le dicen a Vim que puede eliminar el espacio en blanco al comienzo de la línea, un salto de línea y el carácter anterior a donde inició el modo Insertar.

source: This tells Vim to keep a backup copy of a file when overwriting it.
es_es: Esto le dice a Vim que mantenga una copia de seguridad de un archivo cuando lo sobreescribe.

source: But not on the VMS system, since it keeps old versions of files already.
es_es: Pero no en el sistema VMS, ya que éste mantiene versiones anteriores por su cuenta.

source: The backup file will have the same name as the original file with "~" added.
es_es: El backup tendrá el mismo nombre con un «~» delante.

source: See |07.4| >
es_es: Véase |07.4| >

source: Keep 50 commands and 50 search patterns in the history.
es_es: Mantiene 50 órdenes y 50 patrones de búsqueda en el historial.

source: Use another number if you want to remember fewer or more lines.
es_es: Use otro número si quiere almacenar más o menos líneas.

source: Display an incomplete command in the lower right corner of the Vim window, left of the ruler.
es_es: Muestra una orden incompleta en la esquina inferior derecha de la ventana de Vim, a la izquierda del «ruler» (regla).

source: For example, when you type "2f", Vim is waiting for you to type the character to find and "2f" is displayed.
es_es: Por ejemplo, cuando pulsa «2f», Vim está esperando que introduzcas el carácter a encontrar y muestra «2f» es mostrado.

source: When you press "w" next, the "2fw" command is executed and the displayed "2f" is removed.
es_es: Cuando pulse «w», la orden «2fw» es ejecutará y el «2f» se eliminará.

source: This mapping yanks the visually selected text and searches for it in C files.
es_es: Esta macro copia el texto seleccionado visualmente y lo busca en archivos C.

source: This is a complicated mapping.
es_es: Este es una macro complicado.

source: You can see that mappings can be used to do quite complicated things.
es_es: Aquí puede ver que los macro se pueden emplear para hacer cosas realmente complicadas.

source: Still, it is just a sequence of commands that are executed like you typed them.
es_es: En cualquier caso, es simplemente una secuencia de órdenes que se ejecutan justo como los tecleas.

source: This switches on syntax highlighting, but only if colors are available.
es_es: Esto activa el resaltado de sintaxis, pero sólo si hay colores disponibles.

source: And the 'hlsearch' option tells Vim to highlight matches with the last used search pattern.
es_es: Y la opción 'hlsearch' le dice a Vim que resalte las coincidencias con el último patrón de búsqueda empleado.

source: The "if" command is very useful to set options only when some condition is met.
es_es: La orden «if» es muy útil para activar opciones sólo cuando se cumple alguna condición.

source: More about that in |usr_41.txt|.
es_es: Véase |usr_41.txt|

source: Using filetype plugin files Many different filetypes are edited with different options.
es_es: Usar extensiones de tipo de archivo («filetype plugin») Muchos tipos de archivo se editan con diferentes opciones.

source: For example, when you edit a "c" file, it's very useful to set the 'cindent' option to automatically indent the lines.
es_es: Por ejemplo, cuando edita un archivo «c», es muy útil activar la opción «cindent» para sangrar las líneas automáticamente.

source: These commonly useful option settings are included with Vim in filetype plugins.
es_es: Estas opciones empleadas comúnmente están incluidas con Vim en las extensiones de tipos de archivo.

source: You can also add your own, see |write-filetype-plugin|.
es_es: También puede incluir las tuyas propias, consulte |write-filetype-plugin|.

source: Using indent files When editing programs, the indent of a line can often be computed automatically.
es_es: Usar archivos de tabulación Cuando edita programas, la sangría de una línea puede a menudo ser computada de manera automática.

source: Vim comes with these indent rules for a number of filetypes.
es_es: Vim viene con esas reglas de sangrado para diversos tipos de archivo.

source: See |:filetype-indent-on| and 'indentexpr'.
es_es: Véase |:filetype-indent-on| y 'indentexpr'.

source: This makes Vim break text to avoid lines getting longer than 78 characters.
es_es: Esto hace que Vim divida el texto para evitar que las líneas sean más largas de 78 caracteres.

source: But only for files that have been detected to be plain text.
es_es: Pero sólo para archivos que se han identificado como de texto regular.

source: There are actually two parts here.
es_es: Aqui hay dos aspectos.

source: "autocmd FileType text" is an autocommand.
es_es: «autocmd FileType text» es una autoorden.

source: This defines that when the file type is set to "text" the following command is automatically executed.
es_es: Esto define que cuando el tipo de archivo sea «texto», la orden posterior se ejecute automáticamente.

source: "setlocal textwidth=78" sets the 'textwidth' option to 78, but only locally in one file.
es_es: «setlocal textwidth=78» ajusta la opción 'textwidth' a 78, pero sólo localmente a un archivo.

source: Another autocommand.
es_es: Otra autoorden.

source: This time it is used after reading any file.
es_es: Esta vez se ejecuta tras leer cualquier archivo.

source: The complicated stuff after it checks if the '" mark is defined, and jumps to it if so.
es_es: Las cosas tan complicadas que hay después de él comprueban si la marca '" está definida, y salta hacia ella si lo está.

source: The backslash at the start of a line is used to continue the command from the previous line.
es_es: La barra inversa al comienzo de la línea se emplea para continuarla desde la anterior.

source: That avoids a line getting very long.
es_es: Esto ayuda a acortar las líneas.

source: See |line-continuation|.
es_es: Véase |line-continuation|.

source: This only works in a Vim script file, not when typing commands at the command-line.
es_es: Esto funciona sólo dentro de un script de Vim, no cuando se teclean órdenes en la línea de órdenes.

source: A mapping enables you to bind a set of Vim commands to a single key.
es_es: Una macro le permite ligar un conjunto de órdenes de Vim a una sola tecla.

source: Suppose, for example, that you need to surround certain words with curly braces.
es_es: Suponga, por ejemplo, que necesita poner una palabra entre llaves.

source: In other words, you need to change a word such as "amount" into "{amount}".
es_es: En otras palabras necesita cambiar una palabra como «cantidad» a «{cantidad}».

source: With the :map command, you can tell Vim that the F5 key does this job.
es_es: Con la orden :map, puede decirle a Vim que la tecla F5 haga precisamente eso.

source: The command is as follows: >
es_es: La orden es la siguiente: >

source: :map <F5> i{<Esc>ea}<Esc> < Note: When entering this command, you must enter <F5> by typing four characters.
es_es: :map <F5> i{<Esc>ea}<Esc> < Nota: Cuando introduzca esta orden, debe introducir <F5> tecleando cuatro caracteres.

source: Similarly, <Esc> is not entered by pressing the <Esc> key, but by typing five characters.
es_es: De igual manera, <Esc> no se introduce pulsando la tecla <Esc>, sino tecleando cinco caracteres.

source: Watch out for this difference when reading the manual!
es_es: De hecho, ¡¡has de poner los nombres en inglés, no la versión traducida!!

source: Let's break this down: <F5> The F5 function key.
es_es: Veámoslo por partes: <F5> La tecla de función F5.

source: This is the trigger key that causes the command to be executed as the key is pressed.
es_es: Esta es la tecla que lanzará la orden para que éste se ejecute al ser pulsada.

source: i{<Esc> Insert the { character.
es_es: i{<Esc> Insertar el carácter {.

source: The <Esc> key ends Insert mode.
es_es: <Esc> sale del modo Insertar.

source: The ":map" command (with no arguments) lists your current mappings.
es_es: La orden «:map» (sin argumentos) le da un listado de sus macros actuales.

source: At least the ones for Normal mode.
es_es: Al menos aquellos en el modo Normal.

source: More about mappings in section |40.1|.
es_es: Más sobre macros en la sección |40.1|.

source: Vim's functionality can be extended by adding plugins.
es_es: La funcionalidad de Vim puede ser extendida añadiendo extensiones.

source: A plugin is nothing more than a Vim script file that is loaded automatically when Vim starts.
es_es: Una extensiones no es nada más que un script de Vim que se carga automáticamente cuando Vim arranca.

source: You can add a plugin very easily by dropping it in your plugin directory.
es_es: Puede añadir nuevas extensiones añadiéndolos al directorio de extensiones.

source: {not available when Vim was compiled without the |+eval| feature}
es_es: {no disponible si no se ha compilad con Vim con la opción |+eval|}.

source: When you start Vim, it will automatically load a number of global plugins.
es_es: Cuando arranque Vim, verá que carga automáticamente un grupo de extensiones globales.

source: You don't have to do anything for this.
es_es: No tiene que hacer nada al respecto.

source: They add functionality that most people will want to use, but which was implemented as a Vim script instead of being compiled into Vim.
es_es: Éstos añaden funcionalidad que le interesan a la mayoría de gente, pero que se implementaron como scripts de Vim en lugar de compilarlos en Vim.

source: You can find them listed in the help index |standard-plugin-list|.
es_es: Puedes verlos listados en el índice de ayuda |standard-plugin-list|.

source: Also see |load-plugins|.
es_es: Véase también |load-plugins|.

source: *add-global-plugin* You can add a global plugin to add functionality that will always be present when you use Vim.
es_es: *add-global-plugin* Puede poner un extensión global para añadir funcionalidad que deba estar siempre presente cuando use Vim.

source: There are only two steps for adding a global plugin: 1.
es_es: Sólo tiene que seguir dos pasos para añadir una extensión global: 1.

source: Get a copy of the plugin. 2.
es_es: Conseguir una copia de la extensión. 2.

source: Where can you find plugins?
es_es: ¿Dónde encontrar extensiones?

source: - Some come with Vim.
es_es: - Algunos vienen con Vim.

source: You can find them in the directory $VIMRUNTIME/macros and its sub-directories.
es_es: Puede encontrarlos en el directorio $VIMRUNTIME/macro y sus subdirectorios.

source: - Download from the net.
es_es: - Descargarlos de la red.

source: There is a large collection on http://www.vim.org.
es_es: Hay una buena colección en http://www.vim.org.

source: - They are sometimes posted in a Vim |maillist|.
es_es: - Algunas veces se envían a la |maillist| de Vim.

source: - You could write one yourself, see |write-plugin|.
es_es: - Puede escribir uno usted mismo, consulte |write-plugin|.

source: Some plugins come as a vimball archive, see |vimball|.
es_es: Algunas extensiones vienen como un archivo comprimido, consulte |vimball|.

source: Some plugins can be updated automatically, see |getscript|.
es_es: Algunas extensiones pueden ser actualizados automáticamente, consulte |getscript|.

source: First read the text in the plugin itself to check for any special conditions.
es_es: Lea primero el texto en la extensión descargada para comprobar cualquier requerimiento.

source: Then copy the file to your plugin directory:
es_es: A continuación copielo al directorio de extensiones:

source: Now you can use the commands defined in this plugin to justify text.
es_es: Ahora puede usar las órdenes definidas en esta extensión para justificar texto.

source: Instead of putting plugins directly into the plugin/ directory, you may better organize them by putting them into subdirectories under plugin/.
es_es: En lugar de poner las extensiones directamente en el directorio «plugins/», quizá prefiera organizarlos poniéndolos en subdirectorios dentro de «plugins/».
